src/CFD/ConvergenceStudy-luke/z-study/pipe_validation_z_base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          550;
        startFace       17870;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       18420;
    }
    heatedWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          450;
        startFace       18520;
    }
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       18970;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       19030;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2640;
        startFace       19090;
    }
)

// ************************************************************************* //
